In [4]:
# Dependencies and Setup
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [13]:
# Import Data from dataset
df_land_temp = pd.read_csv("data_sets/GlobalLandTemperaturesByCountry.csv")

In [14]:
df_land_temp

,dt,AverageTemperature,AverageTemperatureUncertainty,Country
0,1743-11-01,4.384,2.294,Åland
1,1743-12-01,NaN,NaN,Åland
2,1744-01-01,NaN,NaN,Åland
3,1744-02-01,NaN,NaN,Åland
4,1744-03-01,NaN,NaN,Åland
...,...,...,...,...
577457,2013-05-01,19.059,1.022,Zimbabwe
577458,2013-06-01,17.613,0.473,Zimbabwe
577459,2013-07-01,17.000,0.453,Zimbabwe
577460,2013-08-01,19.759,0.717,Zimbabwe
577461,2013-09-01,NaN,NaN,Zimbabwe

In [15]:
splited_land_ser = df_land_temp['dt'].str.split('-').str[0]
splited_land_ser

0         1743
1         1743
2         1744
3         1744
4         1744
          ...
577457    2013
577458    2013
577459    2013
577460    2013
577461    2013
Name: dt, Length: 577462, dtype: object

In [16]:
df_land_temp["year"] = splited_land_ser.astype("int64")

In [17]:
df_land_temp

,dt,AverageTemperature,AverageTemperatureUncertainty,Country,year
0,1743-11-01,4.384,2.294,Åland,1743
1,1743-12-01,NaN,NaN,Åland,1743
2,1744-01-01,NaN,NaN,Åland,1744
3,1744-02-01,NaN,NaN,Åland,1744
4,1744-03-01,NaN,NaN,Åland,1744
...,...,...,...,...,...
577457,2013-05-01,19.059,1.022,Zimbabwe,2013
577458,2013-06-01,17.613,0.473,Zimbabwe,2013
577459,2013-07-01,17.000,0.453,Zimbabwe,2013
577460,2013-08-01,19.759,0.717,Zimbabwe,2013
577461,2013-09-01,NaN,NaN,Zimbabwe,2013

In [24]:
df_land_temp_1963 = df_land_temp.loc[(df_land_temp["year"] > 1962) & (df_land_temp["year"] < 2016),:].copy()
df_land_temp_1963

,dt,AverageTemperature,AverageTemperatureUncertainty,Country,year
2630,1963-01-01,-6.288,0.981,Åland,1963
2631,1963-02-01,-8.085,0.587,Åland,1963
2632,1963-03-01,-5.510,0.558,Åland,1963
2633,1963-04-01,1.452,0.743,Åland,1963
2634,1963-05-01,9.560,0.433,Åland,1963
...,...,...,...,...,...
577457,2013-05-01,19.059,1.022,Zimbabwe,2013
577458,2013-06-01,17.613,0.473,Zimbabwe,2013
577459,2013-07-01,17.000,0.453,Zimbabwe,2013
577460,2013-08-01,19.759,0.717,Zimbabwe,2013
577461,2013-09-01,NaN,NaN,Zimbabwe,2013

In [23]:
df_land_temp_1963

,dt,AverageTemperature,AverageTemperatureUncertainty,Country,year
2630,1963-01-01,-6.288,0.981,Åland,1963
2631,1963-02-01,-8.085,0.587,Åland,1963
2632,1963-03-01,-5.510,0.558,Åland,1963
2633,1963-04-01,1.452,0.743,Åland,1963
2634,1963-05-01,9.560,0.433,Åland,1963
...,...,...,...,...,...
577457,2013-05-01,19.059,1.022,Zimbabwe,2013
577458,2013-06-01,17.613,0.473,Zimbabwe,2013
577459,2013-07-01,17.000,0.453,Zimbabwe,2013
577460,2013-08-01,19.759,0.717,Zimbabwe,2013
577461,2013-09-01,NaN,NaN,Zimbabwe,2013